// Дадено е цяло число – начален брой точки. 
//Върху него се начисляват бонус точки по правилата, описани по-долу. 
//Да се напише функция, която пресмята бонус точките, които получава числото и общия брой точки 
//(числото + бонуса).
// •	Ако числото е до 100 включително, бонус точките са 5.
// •	Ако числото е по-голямо от 100, бонус точките са 20% от числото.
// •	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.

// •	Допълнителни бонус точки (начисляват се отделно от предходните):
// o	За четно число  + 1 т.
// o	За число, което завършва на 5  + 2 т.

function bonusScore(input){

    let num = Number(input[0]);

    let bonus = 0;
    if(num <= 100){
        bonus = num + 5;
    } else if (num>100 && num <= 1000){
        bonus = num + (num*0.2);
    }  else if (num>1000){
        bonus = num + (num*0.1);
    }

    if(num % 2 === 0){
        bonus = bonus + 1;
    } else if (num % 5 === 0) {
        bonus = bonus + 2;
    }

    console.log(Math.abs(num-bonus));
    console.log(bonus);
}

bonusScore(["20"])