// Напишете програма, която да умножава положителни числа по 2.
// От конзолата се четат поредица от реални числа, всяко на нов ред, докато не се въведе отрицателно.
// След всяко умножено число на нов ред да се отпечата "Result: {резултата от умножението}".
// Резултата от умножението да бъде форматиран до втория знак след десетичния разделител.
// При получаване на негативно число, на конзолата да се отпечата "Negative number!"
// и програмата да приключи изпълнение.

function multiplyBy2(input) {
  let index = 0;
  let num = Number(input[index]);

  let multiply = 0;

  while (num >= 0) {
    multiply = num * 2;

    console.log(`Result: ${multiply.toFixed(2)}`);

    index++;
    num = Number(input[index]);
  }

  if (num < 0) {
    console.log("Negative number!");
  }
}

multiplyBy2([12, 43.2144, 12.3, -3]);
