// Басейн с обем V има две тръби от които се пълни. 
// Всяка тръба има определен дебит (литрите вода минаващи през една тръба за един час). 
// Работникът пуска тръбите едновременно и излиза за N часа. 
// Напишете програма, която изкарва състоянието на басейна, в момента, когато работникът се върне. 
// Вход
// От конзолата се четат четири реда:
// •	Първият ред съдържа числото V – Обем на басейна в литри – цяло число в интервала [1…10000].
// •	Вторият ред съдържа числото P1 – дебит на първата тръба за час – цяло число в интервала [1…5000].
// •	Третият ред съдържа числото P2 – дебит на втората тръба за час– цяло число в интервала [1…5000].
// •	Четвъртият ред съдържа числото H – часовете които работникът отсъства – реално число в интервала [1.0…24.00]
// Изход
// Да се отпечата на конзолата едно от двете възможни състояния:
// •	До колко се е запълнил басейна и коя тръба с колко процента е допринесла.
// o	"The pool is {запълненост на басейна в проценти}% full. Pipe 1: {процент вода от първата тръба}%. Pipe 2: {процент вода от втората тръба}%."
// Aко басейнът се е препълнил – с колко литра е прелял за даденото време.
// o	"For {часовете, които тръбите са пълнили вода} hours the pool overflows with {литрите вода в повече} liters."

function pipesInPool(input) {

    let v = input[0];
    let p1 = input[1];
    let p2 = input[2];
    let h = input[3];

    let p1V = p1 * h;
    let p2V = p2 * h;

    let pipeV = p1V + p2V;

    let vPercent = pipeV / v * 100;
    let p1Percent = p1V / pipeV * 100;
    let p2Percent = p2V / pipeV * 100;

    if (v >= pipeV) {

        console.log(`The pool is ${vPercent.toFixed(2)}% full. 
        Pipe 1: ${p1Percent.toFixed(2)}%. 
        Pipe 2: ${p2Percent.toFixed(2)}%.`);
    } else {
        let diff = pipeV - v;
        console.log(`For ${h} hours the pool overflows with ${diff.toFixed(2)} liters.`);
    }

}

pipesInPool([1000,
    100,
    120,
    3])
