// Студент трябва да пропътува n километра.
// Той има избор измежду три вида транспорт:
// •	Такси. Начална такса: 0.70 лв. Дневна тарифа: 0.79 лв. / км. Нощна тарифа: 0.90 лв. / км.
// •	Автобус. Дневна / нощна тарифа: 0.09 лв. / км. Може да се използва за разстояния минимум 20 км.
// •	Влак. Дневна / нощна тарифа: 0.06 лв. / км. Може да се използва за разстояния минимум 100 км.
// Напишете програма, която въвежда броя километри n и период от деня (ден или нощ) и изчислява цената на най-евтиния транспорт.
// Вход
// От конзолата се четат два реда:
// •	Първият ред съдържа числото n – брой километри – цяло число в интервала [1…5000]
// •	Вторият ред съдържа дума “day” или “night” – пътуване през деня или през нощта
// Изход
// Да се отпечата на конзолата най-ниската цена за посочения брой километри, форматирана до втория знак след десетичния разделител.

function transportPrice(input) {
  let n = Number(input[0]);
  let zone = input[1];

  let taxiPrice = 0;
  let busPrice = 0.09 * n;
  let trainPrice = 0.06 * n;

  let minPrice = 0;

  if (zone === "day") {
    taxiPrice = 0.7 + 0.79 * n;
  } else if (zone === "night") {
    taxiPrice = 0.7 + 0.9 * n;
  }

  if (n <= 19) {
    minPrice = taxiPrice;
  } else if (n >= 20 && n <= 99) {
    minPrice = Math.min(taxiPrice, busPrice);
  } else {
    minPrice = Math.min(taxiPrice, busPrice, trainPrice);
  }

  console.log(minPrice.toFixed(2));
}

transportPrice(["25", "day"]);
