// Провокирани от сватбата си, Михаела и Иван решават да предоставят нова услуга на клиенти на ресторанта си,
//а именно вечеря за запознанства - "Предизвикай Сватбата".
//Напишете програма, която отпечатва всички възможни срещи на клиентите на ресторанта.
// При настаняване всеки мъж и всяка жена получават талончета с поредни номера, стартирайки от 1.
//Ако бъдат заети всички маси, програмата трябва да приключи. Всяка маса има две места.
// Вход
// От конзолата се четат точно 3 числа, всяко на отделен ред:
// •	Броят клиенти мъже - цяло число в интервала [1...100]
// •	Броят клиенти жени - цяло число в интервала [1...100]
// •	Максималният брой маси - цяло число в интервала [1...100]
// Изход
// На конзолата се принтират на един ред, разделени с интервал всички срещи в следният формат:
// •	({№ клиент} <-> {№ клиент}) ({№ клиент} <-> {№ клиент}) ...

function challengeTheWedding(input) {
  let men = Number(input[0]);
  let women = Number(input[1]);
  let tablesMax = Number(input[2]);

  let result = "";
  let tableCount = 0;
  for (let m = 1; m <= men; m++) {
    for (let f = 1; f <= women; f++) {
      tableCount++;
      result += `(${m} <-> ${f}) `;

      if (tableCount == tablesMax) {
        console.log(result);
        return;
      }
    }
  }

  console.log(result);
}

//challengeTheWedding(["2", "2", "6", ""]);
challengeTheWedding(["2", "2", "3"]);
//challengeTheWedding(["5", "8", "40"]);
