// Да се напише програма, която чете две цели числа n и l, въведени от потребителя,
// и генерира по азбучен ред всички възможни  пароли, които се състоят от следните 5 символа:
// •	Символ 1: цифра от 1 до n.
// •	Символ 2: цифра от 1 до n.
// •	Символ 3: малка буква измежду първите l букви на латинската азбука.
// •	Символ 4: малка буква измежду първите l букви на латинската азбука.
// •	Символ 5: цифра от 1 до n, по-голяма от първите 2 цифри.
// Вход
// Входът се чете от конзолата и се състои от две цели числа n и l в интервала [1…9], по едно на ред.
// Изход
// На конзолата трябва да се отпечатат всички пароли по азбучен ред, разделени с интервал

function passwordGenerator(input) {
  let n = Number(input[0]);
  let l = Number(input[1]);

  let combinations = "";
  for (let d1 = 1; d1 <= n; d1++) {
    for (let d2 = 1; d2 <= n; d2++) {
      for (let l1ascii = 97; l1ascii < 97 + l; l1ascii++) { //ASCII
        let l1 = String.fromCharCode(l1ascii);
        for (let l2ascii = 97; l2ascii < 97 + l; l2ascii++) {//ASCII
          let l2 = String.fromCharCode(l2ascii);
          for (let d3 = 1; d3 <= n; d3++) {
            if (d3 > d1 && d3 > d2) {
              combinations += `${d1}${d2}${l1}${l2}${d3} `;
            }
          }
        }
      }
    }
  }

  console.log(combinations);
}

passwordGenerator(["2", "4"]);
