// Напишете функция, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени следните условия:
// •	На всеки четен етаж има само офиси
// •	На всеки нечетен етаж има само апартаменти
// •	Всеки апартамент се означава по следния начин : A{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0.
// •	Всеки офис се означава по следния начин : O{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0.
// •	На последният етаж винаги има апартаменти и те са по-големи от останалите, за това пред номера им пише 'L', вместо 'A'. Ако има само един етаж, то има само големи апартаменти!
// Функцията получава масив от две цели числа - броят на етажите и броят на стаите за един етаж.

function building(input) {
  let floors = Number(input[0]);
  let room = Number(input[1]);

  let result = " ";

  for (let f = floors; f >= 1; f--) {
    for (let r = 0; r < room; r++) {
      if (f === floors) {
        //console.log(`L${f}${r}`);

        if (r === room - 1) {
          result = result + "L" + f + r;
        } else {
          result = result + "L" + f + r + " ";
        }
      } else if (f % 2 === 0) {
        //console.log(`O${f}${r}`);
        if (r === room - 1) {
          result = result + "O" + f + r;
        } else {
          result = result + "O" + f + r + " ";
        }
      } else {
        //console.log(`A${f}${r}`);
        if (r === room - 1) {
          result = result + "A" + f + r;
        } else {
          result = result + "A" + f + r + " ";
        }
      }
    }

    console.log(result);
    result = " ";
  }
}

building(["6", "4"]);
